{
    "1": "May we be guided on the Straight Path as Allah instructs in Al-Fatiha (1:6).",
    "2": "Grant us patience in our trials, as mentioned in Al-Baqarah (2:153).",
    "3": "We seek forgiveness for our sins, as promised in Al-Zumar (39:53).",
    "4": "May Allah's mercy and compassion envelop us, as described in Ar-Rahman (55:1-2).",
    "5": "We ask for wisdom and knowledge, as Allah advises in Taha (20:114).",
    "6": "Protect us from evil, as we are taught in Al-Mu'minun (23:97-98).",
    "7": "Strengthen our faith, as exemplified in Al-Anfal (8:2-4).",
    "8": "Guide us to success in the Hereafter, as outlined in Al-Mu'minun (23:1-11).",
    "9": "Bless us with righteous offspring, as mentioned in Al-Furqan (25:74).",
    "10": "Provide relief from anxiety, as Allah comforts in Ar-Ra'd (13:28).",
    "11": "Help us to be thankful, as encouraged in Ibrahim (14:7).",
    "12": "Grant us healing and health, as Prophet Ibrahim (AS) prayed in Ash-Shu'ara (26:80).",
    "13": "Bestow upon us good in this world and the Hereafter, as stated in Al-Baqarah (2:201).",
    "14": "Enable us to act with justice and fairness, as commanded in An-Nisa (4:135).",
    "15": "Instill in us humility and modesty, as described in Al-Furqan (25:63).",
    "16": "Illuminate our path with true guidance and light, as illustrated in An-Nur (24:35).",
    "17": "Develop within us a forgiving nature, as Allah loves in Al-Imran (3:133-134).",
    "18": "Keep us steadfast in prayer, as Prophet Ibrahim (AS) requested in Ibrahim (14:37).",
    "19": "Protect us from misguidance, as warned in Al-An'am (6:43).",
    "20": "Cleanse our hearts, as advised in Ash-Shams (91:9-10).",
    "21": "Relieve us from hardship, as Allah promises in Ash-Sharh (94:5-6).",
    "22": "Help us to worship with sincerity, as instructed in Al-Bayyina (98:5).",
    "23": "Grant us contentment and peace in times of difficulty, as assured in At-Talaq (65:2-3).",
    "24": "Inspire us to be charitable and generous, as encouraged in Al-Hadid (57:7).",
    "25": "Guide us to the truth, as Allah questions in Yunus (10:35).",
    "26": "Shield us from envy and harm, as we seek refuge in Al-Falaq (113:1-5).",
    "27": "Give us strength to bear our burdens, as Allah reassures in Al-Baqarah (2:286).",
    "28": "Teach us to forgive others, as exemplified in An-Nur (24:22).",
    "29": "Unite us in brotherhood and peace, as enjoined in Al-Hujurat (49:10).",
    "30": "Guide us towards purity and Taqwa, as Allah describes in Al-A'raf (7:26)."
  }
  